tsung_cluster.xml
<?xml version="1.0" encoding="ISO-8859-1"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] >
<!--<tsung version="1.0"> -->
<tsung loglevel="debug" dumptraffic="true" version="1.0">

<clients>
  <client host="localhost" use_controller_vm="true" maxusers="10000" />
<!--  <client host="smr1-stress-tsung-1"   use_controller_vm="true" maxusers="10000" />

  <client host="smr1-stress-tsung-2"  maxusers="10000" />
  <client host="smr1-stress-tsung-3"  maxusers="10000" />
  <client host="smr1-stress-tsung-4"  maxusers="10000" />
  <client host="smr1-stress-tsung-5"  maxusers="10000" />
  <client host="smr1-stress-tsung-6"  maxusers="10000" />
  <client host="smr1-stress-tsung-7"  maxusers="10000" />-->
</clients>

<servers>
  <server host="10.63.194.103" port="6767" type="tcp"></server>
</servers>

<load>
  <!-- 10 minutes arrival phase -->
  <arrivalphase phase="1" duration="10" unit="minute">
    <users arrivalrate="125" unit="second"></users>
  </arrivalphase>
</load>
<options>
<!-- <option name="max_retries" value="0" />
<option name="retry_timeout" value="0" />
<option name="idle_timeout" value="10" /> -->
<!-- <option name="file_server" id="default" value="/root/rpmbuild/SOURCES/calm-load-test/data200.csv"/> -->
</options>
<sessions> 

<!-- one session for each device: 199200 sessions -->
  <session weight="1" name="175" type="ts_raw">
<!--    <for from="1" to="100" incr="1" var="counter"> -->
<!--<setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok}=erlang:garbage_collect(Pid, async) end.">
	<var name="dummy" />
</setdynvars> -->

<setdynvars sourcetype="erlang" callback="csv_reader_nif:getline">
<!--  <setdynvars sourcetype="file" fileid="default" delimiter=";" order="iter">-->
    <var name="auth"/>
    <var name="handshake"/>
    <var name="data"/>
  </setdynvars>
  

     <!-- limit speed to 5 KB/sec -->
    <!--     <set_option name="rate_limit" value="5" /> -->
     <!-- data packet -->
     <request subst="true"> 
	<match do='dump' when='nomatch' apply_to_content='base64:encode' subst='true'>AAQIBAAA</match>
     	<raw base64data='%%_data%%' ack="local"></raw> 
     </request>
<!--	<thinktime value="1" random="false"></thinktime> -->

  </session>
</sessions>
</tsung>