tsung_plugin.xml
<?xml version="1.0" encoding="ISO-8859-1"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd" [] >
<!--<tsung version="1.0"> -->
<tsung loglevel="debug" dumptraffic="true" version="1.0">

<clients>
  <client host="localhost" use_controller_vm="true" maxusers="2000"/>
</clients>

<servers>
  <server host="192.168.4.106" port="10000" type="tcp"></server>
</servers>

<load>
  <!-- 20 minutes arrival phase -->
  <arrivalphase phase="1" duration="5" unit="minute">
    <!-- 166 users per second - approx. 199200 users /devices/ in 20 minutes. -->
    <users arrivalrate="166" unit="second"></users>
  </arrivalphase>
</load>
<options>
<option name="max_retries" value="0" />
<option name="retry_timeout" value="0" />
<option name="idle_timeout" value="10" />
<!-- <option name="file_server" id="default" value="/root/rpmbuild/SOURCES/load-test/data200.csv"/> -->
</options>
<sessions> 

<!-- one session for each device: 199200 sessions -->
  <session weight="1" name="175" type="ts_raw">
<!--    <for from="1" to="100" incr="1" var="counter"> -->
<!--<setdynvars sourcetype="eval" code="fun({Pid,DynVars})->{ok}=erlang:garbage_collect(Pid, async) end.">
	<var name="dummy" />
</setdynvars> -->

<setdynvars sourcetype="erlang" callback="csv_reader_nif:getline">
<!--  <setdynvars sourcetype="file" fileid="default" delimiter=";" order="iter">-->
    <var name="auth"/>
    <var name="handshake"/>
    <var name="data"/>
  </setdynvars>
  

     <!-- limit speed to 5 KB/sec -->
    <!--     <set_option name="rate_limit" value="5" /> -->
     <!-- first auth packet -->
          <request subst="true"> 
          <raw base64data="%%_auth%%" ack="local"></raw> 
          </request> 
     <!-- second auth packet -->
           <request subst="true"> 
           <raw base64data="%%_handshake%%" ack="local"></raw> 
           </request>
     <!-- data packet -->
     <request subst="true"> 
     <raw base64data='%%_data%%' ack="local"></raw> 
     </request>
<!--	<thinktime value="1" random="false"></thinktime> -->

<!--    </for> -->
  </session>
</sessions>
</tsung>